---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FillPattern
source: html/340cb2f0-bdfd-19a9-accd-a533d921c40b.htm
---
# FillPattern Members

Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.